{"modelName":"LSTM-Bustout","modelVersion":"5","modelType":"KERAS","kerasJson":{"backend":"tensorflow","class_name":"Sequential","config":[{"class_name":"LSTM","config":{"activation":"tanh","batch_input_shape":[null,null,5],"bias_initializer":{"class_name":"Zeros","config":{}},"dropout":0.1,"dtype":"float32","go_backwards":false,"implementation":0,"kernel_initializer":{"class_name":"VarianceScaling","config":{"distribution":"uniform","mode":"fan_avg","scale":1}},"name":"lstm_1","recurrent_activation":"hard_sigmoid","recurrent_dropout":0.1,"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1}},"return_sequences":true,"return_state":false,"stateful":false,"trainable":true,"unit_forget_bias":true,"units":20,"unroll":false,"use_bias":true}},{"class_name":"LSTM","config":{"activation":"tanh","bias_initializer":{"class_name":"Zeros","config":{}},"dropout":0,"go_backwards":false,"implementation":0,"kernel_initializer":{"class_name":"VarianceScaling","config":{"distribution":"uniform","mode":"fan_avg","scale":1}},"name":"lstm_2","recurrent_activation":"hard_sigmoid","recurrent_dropout":0,"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1}},"return_sequences":false,"return_state":false,"stateful":false,"trainable":true,"unit_forget_bias":true,"units":20,"unroll":false,"use_bias":true}},{"class_name":"Dense","config":{"activation":"sigmoid","bias_initializer":{"class_name":"Zeros","config":{}},"kernel_initializer":{"class_name":"VarianceScaling","config":{"distribution":"uniform","mode":"fan_avg","scale":1}},"name":"dense_1","trainable":true,"units":1,"use_bias":true}}],"keras_version":"2.0.8"}}