{"modelName":"keras-creditcard","modelVersion":"1","modelType":"KERAS","entryPoint":"","performanceJson":"","outputFolder":"","kerasJson":{"keras_version":"2.1.2","config":{"output_layers":[["output",0,0]],"layers":[{"class_name":"InputLayer","config":{"dtype":"float32","batch_input_shape":[null,28],"name":"input","sparse":false},"name":"input","inbound_nodes":[]},{"class_name":"Dense","config":{"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform"}},"units":128,"use_bias":true,"trainable":true,"name":"dense_1","bias_initializer":{"class_name":"Zeros","config":{}},"activation":"relu"},"name":"dense_1","inbound_nodes":[[["input",0,0,{}]]]},{"class_name":"Dropout","config":{"rate":0.1,"trainable":true,"name":"dropout_1"},"name":"dropout_1","inbound_nodes":[[["dense_1",0,0,{}]]]},{"class_name":"Concatenate","config":{"trainable":true,"name":"concatenate_1","axis":-1},"name":"concatenate_1","inbound_nodes":[[["input",0,0,{}],["dropout_1",0,0,{}]]]},{"class_name":"Dense","config":{"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform"}},"units":2,"use_bias":true,"trainable":true,"name":"output","bias_initializer":{"class_name":"Zeros","config":{}},"activation":"softmax"},"name":"output","inbound_nodes":[[["concatenate_1",0,0,{}]]]}],"input_layers":[["input",0,0]],"name":"model_1"},"class_name":"Model","backend":"tensorflow"}}